tocache/Microchip-PIC18F57Q43/1AEL0256 2025-2/Examples/NRC8449_Sem09_IntroC.X/maincode03.c
/*
 * File:   maincoide01.c
 * Author: Alumnos
 *
 * Created on 24 de octubre de 2025, 04:23 PM
 */
#include <xc.h>
#include "cabecera.h"
#define _XTAL_FREQ 4000000UL

const unsigned char gusanito[] = {0x01, 0x02, 0x40, 0x10,
                                0x08, 0x04, 0x40, 0x20};

void configuro(void){
    //conf modulo de oscilador
    OSCCON1 = 0x60; //NOSC HFINTOSC NDIV 1:1
    OSCFRQ = 0x02;  //HFINTOSC a 4MHz
    OSCEN = 0x40;   //HFINTOSC enabled
    //conf las E/S
    TRISD = 0x80;   //RD(6:0) salidas
    ANSELD = 0x80;  //RD(6:0) digitales
    TRISFbits.TRISF1 = 0;   //RF1 salida
    ANSELFbits.ANSELF1 = 0; //RF1 digital
    TRISEbits.TRISE0 = 0;   //RE0 salida
    ANSELEbits.ANSELE0 = 0; //RE0 digital
    ANSELB = 0xE3;          //RB2 RB3 RB4 digitales
    WPUBbits.WPUB2 = 1;     //RB2 pullup enabled
    //condiciones iniciales
    LATFbits.LATF1 = 1;     //habilito display7s
    //conf de las interrupts
    INT0PPS = 0x0B; //INT0 proviene de RB3
    INT1PPS = 0x0C; //INT1 proviene de RB4
    PIE1bits.INT0IE = 1;    //INT0 enabled
    PIE6bits.INT1IE = 1;    //INT1 enabled
    INTCON0bits.GIE = 1;    //Global interrupt enabled
}

void anima_gusanito_r(unsigned char veces){
    unsigned char x_var, y_var;
    for(y_var=0;y_var<veces;y_var++){
        for(x_var=0;x_var<8;x_var++){
            LATD = gusanito[x_var];
            __delay_ms(50);
        }
    }
}

void anima_gusanito_l(unsigned char veces){
    unsigned char x_var, y_var;
    for(y_var=0;y_var<veces;y_var++){
        for(x_var=0;x_var<8;x_var++){
            LATD = gusanito[7-x_var];
            __delay_ms(50);
        }
    }
}

void main(void) {
    configuro();
    anima_gusanito_r(4);
    anima_gusanito_l(4);
    while(1){
        LATEbits.LATE0 = 1; //LED on
        __delay_ms(300);
        LATEbits.LATE0 = 0; //LED off
        __delay_ms(300);
    }
}

void __interrupt(irq(IRQ_INT0)) INT0_ISR(void){
    PIR1bits.INT0IF = 0;
    anima_gusanito_l(4);
}

void __interrupt(irq(IRQ_INT1)) INT1_ISR(void){
    PIR6bits.INT1IF = 0;
    anima_gusanito_r(4);
}

void __interrupt(irq(default)) DEFAULT_ISR(void){
}